package com.wgz.test;

public class SplitTest {
	public static void main(String[] args) {
		String str1 = "1205076710904864770|2019|50|11|111261|生产验证商户|2011000000|继续教育学院（本）|专升本|2018|2011020000|计算机科学与技术(本科)||||测试账户_分次最小金额大于账单金额|2019-12-12 18:47:32|2019-12-12||测试账户_分次最小金额大于账单金额||YS|N|slyh|0||0|0||CNY|1|银行卡代扣|12312|khxs|学生|测试账户_分次最小金额大于账单金额-产品部|0";
		String[] arr1 = str1.split("\\|",-1);
		for(int i = 0; i<arr1.length; i++)
			System.out.println(i+"--1---:"+arr1[i]);
		String str2 = "1206413322314178582|2019|51|15|111261|生产验证商户|2011000000|继续教育学院（本）|专升本|2018|2011020000|计算机科学与技术(本科)||测试账户_分次最小金额等于账单金额_无附言|2019-12-16 11:18:45|2019-12-16||测试账户_分次最小金额等于账单金额_无附言|2016年1季度|YS|N|slyh|0|1.00|0|0|1.00|CNY|1|微信支付--普通|155523213213123|khxs|学生|测试账户_分次最小金额等于账单金额_无附言-产品部|0";
		String[] arr2 = str2.split("\\|");
		for(int i = 0; i<arr2.length; i++)
			System.out.println(i+"--2---:"+arr2[i]);
		String str3 = "1206413322314178562|2019|51|15|111261|生产验证商户|2011000000|继续教育学院（本）|专升本|2018|2011020000|计算机科学与技术(本科)||测试账户_分次最小金额大于账单金额|2019-12-16 11:18:45|2019-12-16||测试账户_分次最小金额大于账单金额||YS|N|slyh|0|0.01|0|0|0.01|CNY|1|银行卡代扣|12312|khxs|学生|测试账户_分次最小金额大于账单金额-产品部|0";
		String[] arr3 = str3.split("\\|",-1);
		for(int i = 0; i<arr3.length; i++)
			System.out.println(i+"--3---:"+arr3[i]);
	}
}
